Repository: b00bl1k/avtonomerbot
Catalog: avbot/locale/*/LC_MESSAGES/avbot.po
Languages: ru

source: Welcome to @avtonomerbot Input /help for the detailed information. Type /setlang to change language.
ru: Добро пожаловать в @avtonomerbot Введите /help для получения справки по вводу запросов. Введите /setlang для смены языка.

source: Bot for searching on the platesmania.com website Please input one of the following commands:
ru: Бот для поиска по сайту platesmania.com Введите одну из следующих команд:

source: Current language: {}
ru: Текущий язык: {}

source: Choose country:
ru: Выберите страну:

source: Current country: {}
ru: Выбранная страна: {}

source: VIN contains invalid characters
ru: VIN содержит неправильные символы

source: Invalid request, try /help command
ru: Некорректный запрос, попробуйте команду /help

source: Request: {} Specify type of the plate:
ru: Запрос: {} Уточните тип номера:

source: Something went wrong, please try again.
ru: Произошла ошибка, попробуйте ещё раз.

source: Unsupported request. Use /help
ru: Неподдерживаемый запрос, используйте /help получения справки

source: Russia
ru: Россия

source: Soviet Union
ru: СССР

source: United States
ru: США

source: Kazakhstan
ru: Казахстан

source: Uzbekistan
ru: Узбекистан

source: Georgia
ru: Грузия

source: Ukraine
ru: Украина

source: Model
ru: Модель

source: License plate
ru: Госномер

source: Manufactured year
ru: Год производства

source: Engine power
ru: Мощность двигателя

source: hp
ru: л.с.

source: Engine displacement
ru: Объем двигателя

source: ccm
ru: куб. см.

source: Engine number
ru: Номер двигателя

source: No data
ru: Нет данных

source: Nothing found
ru: Ничего не найдено

source: vehicle plate (2014)
ru: автомобильные номера (2014)

source: private vehicle plate (2012)
ru: частные автомобили (2012)

source: vehicle plate 🚗
ru: автомобильные номера 🚗

source: trailer plate
ru: номера прицепов

source: special vehicle plate 🚜
ru: номера спецтехники 🚜

source: motorcycle plate 🏍
ru: номера мотоциклов 🏍

source: transit plate
ru: транзитные номера

source: public transport plate 🚌
ru: номера общественного транспорта 🚌

source: police vehicles plate 🚓
ru: номера полицейских автомобилей 🚓

source: info about region
ru: информация о регионе

source: Region *{region}* — {region_name}
ru: Регион *{region}* — {region_name}

source: Latest series:
ru: Свежие серии:

source: info about vehicle plate series
ru: информация о серии

source: No plates in the series [{series_number}]({url}) yet
ru: В серии [{series_number}]({url}) ещё нет номеров

source: Pictures in the series [{series_number}]({url}): {cnt}
ru: Фотографий в серии [{series_number}]({url}): {cnt}

source: Latest plates:
ru: Последние номера:

source: private vehicles (1980) 🚗
ru: частные автомобили (1980) 🚗

source: regular plates (2004)
ru: обычные номера (2004)

source: info about state plate series (possible states: ga, pa, oh, nc, ny)
ru: информация о серии (поддерживаемые штаты: ga, pa, oh, nc, ny)

source: There are no plates in the series [{series}]({url}) of the state `{state_name}`
ru: В серии [{series}]({url}) штата `{state_name}` ещё нет номеров

source: Pictures in the series [{series}]({url}) of the state `{state_name}`: {cnt}
ru: Фотографий в серии [{series}]({url}) штата `{state_name}`: {cnt}

source: private vehicle plate
ru: частные автомобили
